{
    "data": {
        "items": [
            {
                "id": "0",
                "type": "column",
                "data": {
                    "items": [
                        {
                            "id": "3",
                            "type": "expanded",
                            "data": {
                                "items": [
                                    {
                                        "id": "1",
                                        "type": "scroll_view",
                                        "data": {
                                            "scroll_direction": "vertical",
                                            "alignment": "leading",
                                            "items": [
                                                {
                                                    "id": "3",
                                                    "type": "text",
                                                    "data": {
                                                        "text": "Настоящее Пользовательское соглашение (далее по тексту — «Соглашение») регламентирует отношения между Общество с ограниченной ответственностью «Андрей» (ООО Андрей) (далее по тексту — «Компания») — создателем и правообладателем информационного сайта, и физическим лицом (далее по тексту — «Пользователь») по использованию сайта, находящегося по адресу https://andrey.com (далее — Сайт).\nНастоящее Соглашение является публичной офертой Компании. Используя Сайт, в том числе, путем просмотра страниц и материалов Сайта, Пользователь подтверждает, что он ознакомлен и согласен с Правовой информацией Сайта и настоящим Пользовательским соглашением и означает присоединение Пользователя к настоящему Соглашению и безоговорочное принятие его условий.\n\nНастоящее пользовательское Соглашение распространяется на всех Пользователей Сайта, независимо от цели использования Сайта, и представляет собой публичную оферту в соответствии со ст. 437 Гражданского кодекса РФ. Действие пользовательского соглашения распространяется на Пользователей с момента ввода Имени пользователя (логина) и Пароля. Нажатие кнопки «Зарегистрироваться» обозначает полное и безоговорочное согласие Пользователя с настоящим пользовательским Соглашением, (акцепт оферты) в соответствии со ст. 438 Гражданского кодекса РФ. В случае несогласия с пользовательским Соглашением, Пользователь обязуется прекратить просмотр или пользование услугами Сайта, а также удалить любые материалы, размещенные им на Сайте."
                                                    }
                                                }
                                            ]
                                        }
                                    }
                                ]
                            }
                        },
                        {
                            "id": "4",
                            "type": "check_box",
                            "data": {
                                "items": [
                                    "Согласиться с пользовательским соглашением"
                                ],
                                "isEnabled": true
                            },
                            "actions": [
                                {
                                    "actionName": "didTap",
                                    "type": "updateItems",
                                    "data": {
                                        "items": [
                                            {
                                                "id": "6",
                                                "type": "primary_button",
                                                "data": {
                                                    "title": "Продолжить",
                                                    "isEnabled": true,
                                                    "sizeType": "big"
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "id": "5",
                            "type": "spacer",
                            "layout": {
                                "height": 12
                            }
                        },
                        {
                            "id": "6",
                            "type": "primary_button",
                            "data": {
                                "title": "Продолжить",
                                "isEnabled": false,
                                "sizeType": "big"
                            }
                        },
                        {
                            "id": "10",
                            "type": "spacer",
                            "layout": {
                                "height": 12
                            }
                        }
                    ]
                }
            }
        ]
    }
}